In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv(r"D:\SQL\csv_files_python\4_top_skills_based_on_salary.csv")

In [3]:
df

        skills  avg_salary  total_job_offerts
0        kafka      129999                 40
1      airflow      116387                 71
2        scala      115480                 59
3        linux      114883                 58
4   confluence      114153                 62
5      pyspark      114058                 49
6      mongodb      113608                 52
7          gcp      113065                 78
8        spark      113002                187
9   databricks      112881                102
10         git      112250                 74
11   snowflake      111578                241
12       shell      111496                 44
13        unix      111123                 37
14      hadoop      110888                140
15      pandas      110767                 90
16         php      109052                 29
17       nosql      108331                108
18     express      108221                 96
19    redshift      107969                 90
20        jira      107931                145
21       numpy      107398                 54
22         db2      107130                 38
23  postgresql      106853                 44
24         aws      106440                291